Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་ཀྱི་རྒྱན་ནི་དྲུག་པོ་འདི་དག་སྟེ། དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པ་དང་། བདེན་པའི་རྗེས་སུ་འཐུན་པའི་ཚིག་རབ་ཏུ་ཐོབ་པ་དང་། ང་རྒྱལ་མེད་པས་གཟུང་བར་འོས་པའི་ཚིག་དང་། གཡོ་མེད་པས་བླང་བར་འོས་པའི་ཚིག་དང་། སྙིང་རྗེ་ཆེན་པོ་ལ་སྦྱོར་བས་འབྲས་བུ་ཡོད་པའི་ཆོས་སྟོན་པ་དང་། སྣོད་ལ་མཁས་པས་ཕྱད་པར་ཆོས་སྟོན་པ་དང་། འཇིག་རྟེན་ཤེས་པས་དུས་སུ་ཆོས་སྟོན་པ་སྟེ་དྲུག་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are six types of bodhisattva ornaments of retention: acting in accordance with one’s words, employing statements that correspond to the truth, using words that are suitable to be kept in mind since they are without arrogance, using words that are acceptable because they are without deceptiveness, teaching the Dharma that bears fruit because it is joined with great compassion, teaching the Dharma continuously through tactful knowledge of the audience, and teaching the Dharma in a timely manner through understanding the ways of the world.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་ཀྱི་རྒྱན་ནི་བདུན་པོ་འདི་དག་སྟེ། བདུན་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མགྱོགས་པའི་སྤོབས་པ་དང་། ཤུགས་ཅན་གྱི་སྤོབས་པ་དང་། མྱུར་བའི་སྤོབས་པ་དང་། ཆགས་པ་མེད་པའི་སྤོབས་པ་དང་། རྒྱུན་ཆད་པ་མེད་པའི་སྤོབས་པ་དང་། འཁྲུལ་པ་མེད་པའི་སྤོབས་པ་དང་། ཤིན་ཏུ་ངེས་པའི་ཚིག་གི་སྤོབས་པ་སྟེ། བདུན་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are seven types of bodhisattva ornaments of retention: possessing eloquence that is swift, forceful, quick, dispassionate, uninterrupted, undistorted, and replete with etymologies.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་ཀྱི་རྒྱན་ནི་བརྒྱད་པོ་འདི་དག་སྟེ། བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལྷའི་སྐད་ཤེས་པ་དང་། ཀླུའི་སྐད་ཤེས་པ་དང་། གནོད་སྦྱིན་གྱི་སྐད་ཤེས་པ་དང་། དྲི་ཟའི་སྐད་ཤེས་པ་དང་། ལྷ་མ་ཡིན་གྱི་སྐད་ཤེས་པ་དང་། ནམ་མཁའ་ལྡིང་གི་སྐད་ཤེས་པ་དང་། མི་འམ་ཅིའི་སྐད་ཤེས་པ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་སྐད་ཤེས་པ་ནས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བར་གྱི་སྐད་ཤེས་པ་སྟེ། བརྒྱད་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are eight types of bodhisattva ornaments of retention: knowing the languages of the devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas, up to the languages of all sentient beings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་ཀྱི་རྒྱན་ནི་དགུ་པོ་འདི་དག་སྟེ། དགུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འཁོར་གྱི་ནང་དུ་སྤ་གོང་བ་མེད་པ་དང་། སྨྲ་བའི་ནང་དུ་ཞུམ་པ་མེད་པ་དང་། ཆོས་བཤད་པའི་ནང་དུ་འཇིགས་པ་མེད་པ་དང་། འདྲི་བ་རྣམས་ལ་ངེས་པར་འབྱུང་བ་ཤེས་པ་དང་། མངོན་པའི་ང་རྒྱལ་ཅན་རྣམས་ལ་སྣྲེལ་ཞིར་བསྟན་པ་ཤེས་པ་དང་། ཡང་དག་པར་ཞུགས་པ་རྣམས་ལ་རྗེས་སུ་འཐུན་པ་བསྟན་པ་ཤེས་པ་དང་། ཁེངས་པ་དག་ལ་ལག་ན་རྡོ་རྗེ་སྟོན་པ་དང་། མངོན་པར་ཆགས་པ་རྣམས་ལ་སྲེག་པའི་བསྐལ་པ་སྟོན་པ་དང་། ཡོངས་སུ་སྨིན་པ་རྣམས་ལ་ཐེག་པའི་རིམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྟོན་པ་སྟེ། དགུ་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are nine types of bodhisattva ornaments of retention: not being intimidated in the midst of a gathering, not being dejected among orators, being fearless in the midst of explaining the Dharma, knowing discretion with regard to questioners, knowing how to give a loosely organized teaching to arrogant people, knowing how to give a well-organized teaching to those well on their way, manifesting as Vajrapāṇi to the pretentious, teaching the destruction by fire at the end of the eon to the deeply attached, and teaching the progression of the path exactly as it is to those fully matured.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་ཀྱི་རྒྱན་ནི་བཅུ་པོ་འདི་དག་སྟེ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དོགས་པ་ཐམས་ཅད་ལ་ཐེ་ཚོམ་མེད་པར་སྟོན་པ་ཤེས་པ་དང་། བློས་ཆོས་སྐྱེ་བའི་སྒོ་དང་། ཤེས་རབ་ཀྱི་སྣང་བ་གཞན་ལ་ལྷག་མ་མ་ལུས་པ་དང་། ཡི་གེ་བསྟན་པ་མི་ཟད་པ་དང་། དོན་བསྟན་པ་རྒྱུན་ཆད་པ་མེད་པ་དང་། སངས་རྒྱས་ཀྱི་བསྔགས་པ་མཐའ་ཡས་པ་ཡང་དག་པར་རབ་ཏུ་བརྗོད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་སྐྱོན་མུ་མེད་བར་བརྗོད་པ་དང་། རྣམ་པར་བྱང་བའི་བསྔགས་པ་ཚད་མེད་པ་སྟོན་པ་དང་། དབང་པོ་ཐམས་ཅད་ལ་གཞོལ་བར་འཇུག་པ་ཆགས་པ་མེད་པ་དང་། སངས་རྒྱས་ཀྱིས་གནང་བའི་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་འཇུག་པ་ཤེས་པ་སྟེ།
en: “Son of noble family, there are ten types of bodhisattva ornaments of retention: knowing how to teach without doubt to skeptics, letting the mind be a gate for the arising of Dharma, letting the lamp of insight shine completely for others, inexhaustibly teaching words, uninterruptedly teaching meanings, perfectly expressing boundless praise of the Buddha, describing the endless flaws of moral pollution, teaching the immeasurable praise of moral purification, engaging assiduously and without attachment in accordance with all beings’ faculties, and understanding the application of the discriminating knowledge bestowed on the level of buddhahood.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་དེ་ཉིད་རྒྱ་ཆེར་བསྟན་པའི་ཕྱིར་ཚིགས་སུ་བཅད་བ་འདི་དག་གསུངས་སོ། །
en: Then, in order to elaborate on these points, the Blessed One spoke the following verses:

source: གང་གིས་ཐེག་མཆོག་དམ་པ་འདི་མཛེས་པ། །
en: “What adorn the supreme and noble path

source: བློ་གྲོས་ཆེན་པོ་རྣམས་ཀྱི་རྒྱན་བཞི་སྟེ།
en: Are the four ornaments of those of great intelligence:

source: ཚུལ་ཁྲིམས་ཏིང་འཛིན་དེ་བཞིན་ཤེས་རབ་མཆོག །
en: Morality, absorption, supreme insight,

source: ཤིན་ཏུ་རྣམ་ངེས་དོན་དང་དེ་བཞིན་གཟུངས། །
en: And retention of the definitive meaning.

source: དེ་ནི་ལུས་ཅན་ཀུན་གྱི་ཡིད་འོད་དགའ། །
en: (1) “Being pleasant and delightful toward all creatures

source: ལུས་དང་ངག་རྣམས་དང་ནི་ཡིད་དག་ཅིང་།
en: And pure in body, speech, and mind,

source: དེ་ཡི་རྣམ་པར་ལྷུང་བ་ཀུན་ཆད་པ། །
en: Thus eliminating all downfalls—

source: འདི་ནི་ཚུལ་ཁྲིམས་ལྡན་པའི་རྒྱན་ཡིན་ནོ། །
en: These are the ornaments of morality.

source: ལྷ་མི་རྣམས་ཀྱི་ནང་དུ་མཁས་པ་སྐྱེ། །
en: “Being born as a learned being among gods or humans,

source: དེ་ཡི་སྨོན་ལམ་ཇི་ལྟར་འདོད་བཞིན་འགྲུབ། །
en: Accomplishing what one wishes according to one’s aspiration,

source: ནན་ཏན་སྙིང་པོར་བྱེད་དང་ཡང་དག་ལྡན། །
en: And being endowed with persistence and sincerity—

source: འདི་ནི་ཚུལ་ཁྲིམས་དག་པའི་རྒྱན་ཡིན་ནོ། །
en: These are the ornaments of pure morality.

source: དེ་ཡི་ཏིང་འཛིན་སྒྱུ་མ་མ་ཡིན་ཏེ། །
en: “Absorption that is not illusory,

source: ཤེས་རབ་རྣམ་གྲོལ་དེ་བཞིན་ཡེ་ཤེས་མཐོང་།
en: Insight, liberation, and the vision of liberating wisdom,

source: དེ་ཡི་མྱ་ངན་ལས་འདས་པ་སྒྱུ་མ་མིན། །
en: And nirvāṇa that is not illusory—

source: འདི་ནི་ཚུལ་ཁྲིམས་རྣམ་པར་དག་པའི་རྒྱན། །
en: These are the ornaments of pure morality.

source: ཚུལ་ཁྲིམས་སྐྱོན་མེད་ཚུལ་ཁྲིམས་རྣམ་པར་དག །
en: “Flawless and pure morality,

source: ཚུལ་ཁྲིམས་སྲ་སྲེ་མ་ཡིན་འདྲེན་མ་མེད། །
en: Morality that is not sinful or adulterated,

source: དེ་ཡི་རང་དགའ་དེ་བཞིན་རང་དབང་ཡིན། །
en: And that which is voluntary and autonomous—

source: འདི་ནི་གང་དག་ཚུལ་ཁྲིམས་དག་པའི་རྒྱན། །
en: These are the ornaments of pure morality.

source: ཚུལ་ཁྲིམས་ཀྱིས་ནི་སྦྱིན་པ་དག་པར་འགྱུར། །
en: “Generosity and patience,

source: བཟོད་པ་དག་ཅིང་དེ་བཞིན་བརྩོན་འགྲུས་དག །
en: Vigor, concentration, and insight,

source: བསམ་གཏན་དག་ཅིང་དེ་བཞིན་ཤེས་རབ་དག །
en: Methods and vigilance—

source: ཐབས་དང་དེ་བཞིན་བག་ཡོད་དག་པ་ཡིན། །
en: All are purified by morality.

source: གཡོ་བ་མེད་ཅིང་བརྟན་ལ་ཤིན་ཏུ་གནས། །
en: “Remaining completely unwavering and still,

source: ས་མཆོག་ཐོབ་ཅིང་རྣལ་འབྱོར་རྣམ་འཕྲོ་མེད། །
en: Attaining the supreme levels and remaining focused in spiritual practice,

source: ལྷོད་པ་སྤངས་ཤིང་དགང་སླ་གསོ་ཡང་སླ། །
en: Abandoning laxity, and being at ease—

source: བརྩོན་འགྲུས་འབར་ཞིང་ཚུལ་ཁྲིམས་བསྔགས་པ་སྟེ། །
en: “Igniting vigor and praising morality,

source: དེ་ཡི་སེམས་ནི་ནམ་ཡང་གདུང་མི་འགྱུར། །
en: Being without mental anguish at all times,

source: དེ་ལ་ཡིད་ལ་གཅགས་པར་འགྱུར་མེད་དེ། །
en: And being free of attachment—

source: འཇིགས་པ་མེད་ཅིང་མི་སྐྲག་མི་ཞུམ་སྟེ། །
en: “Being determined, tranquil, and serene,

source: བསམ་པ་དེས་ཤིང་ཞི་ལ་ཡིད་རབ་ཞི། །
en: Without fear and neither anxious nor fainthearted,

source: འདིར་ནི་དེ་ཡི་བཅིངས་པ་ལྷོད་པར་གྱུར། །
en: And to thus be released from bondage to these—

source: གྲགས་ཆེན་སེམས་ནི་ལས་སུ་རུང་བ་ཡིན། །
en: “Having a most praiseworthy mind that is flexible,

source: དེ་ནི་དུལ་ཞིང་དེ་བཞིན་ཅང་ཤེས་ཡིད། །
en: Being disciplined and well bred,

source: འདིར་ནི་རང་ལུས་མཚན་གྱིས་བརྒྱན་བྱེད་པ། །
en: And thus having one’s own body adorned by the marks—

source: དེ་ནི་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད། །
en: “Through conduct that is true to their word,

source: མཁས་པ་དེ་ནི་ངག་གི་རྒྱན་ཐོབ་སྟེ། །
en: The skilled attain the ornament of speech.

source: དེ་ནི་ཉོན་མོངས་མེད་པས་རྟག་སེམས་བརྒྱན། །
en: And are adorned by a steady mind free of afflictive emotion—

source: ཁྱད་པར་འཕགས་པའི་ཞིང་ནི་ལེགས་པར་བརྒྱན། །
en: “Excellently adorning the superb buddhafields,

source: ཐེག་པ་མཆོག་ལ་སེམས་ཅན་ཡོངས་སྨིན་བྱེད། །
en: Bringing sentient beings to maturity in the supreme vehicle,

source: གང་ཕྱིར་སྡིག་པ་ཐམས་ཅད་མི་བྱེད་པས། །
en: And refraining from all sinful deeds—

source: རང་གི་སྐྱེ་བ་ལེགས་པར་བརྒྱན་པར་བྱེད། །
en: These will cause one’s births to be well adorned.

source: བྱང་ཆུབ་སྤྱོད་པ་རྟག་ཏུ་བརྒྱན་བྱེད་ཅིང་། །
en: “Being constantly adorned by awakened conduct,

source: བྱང་ཆུབ་སྙིང་པོ་དམ་པ་བརྒྱན་པར་བྱེད། །
en: Being adorned by the noble seat of awakening,

source: སྟོབས་དང་མི་འཇིགས་པ་དག་བརྒྱན་བྱེད་ཅིང་། །
en: And being adorned by the strengths and the fearlessnesses

source: ང་རྒྱལ་མེད་པས་ཤེས་པ་ལེགས་པར་བརྒྱན། །
en: Is to be well adorned by understanding due to lack of pride.

source: དེ་ནི་བྱམས་པས་སེམས་ཅན་ཀུན་ཁྱབ་བྱེད། །
en: (2) “To embrace all sentient beings with love,

source: མཁས་པ་རྟག་ཏུ་དྲང་དང་མཉེན་པ་ཡིན། །
en: The skilled are ever honest and flexible.

source: གཡོ་ནི་མེད་ཅིང་སྒྱུ་མེད་བཅོས་པ་མེད། །
en: Being free of deception, cunning, and hypocrisy

source: གཏི་མུག་འདོད་སྡང་འཇིགས་པས་འགྲོ་མ་ཡིན། །
en: Is not to be driven by delusion, desire, hatred, and fear.

source: དེ་ནི་སྒྲིབ་པ་ལྔ་པོ་རྣམ་པར་སེལ། །
en: “Removing the five obstructions,

source: བག་ཡོད་གྱུར་ནས་རྗེས་སུ་དྲན་དྲུག་བསྒོམ། །
en: Vigilantly cultivating the six recollections,

source: བྱང་ཆུབ་ཡན་ལག་བདུན་དང་ལམ་སྒོམ་སྟེ། །
en: And cultivating the seven factors of awakening and the eightfold path

source: མཐར་གྱིས་དགུ་དང་ཏིང་འཛིན་བསམ་གཏན་བྱེད། །
en: Yields the concentrations of meditative absorption and, finally, the ninth.

source: རྣལ་འབྱོར་པ་ནི་ཞི་གནས་ངེས་སེམས་སྦྱོར། །
en: “For the practitioner to focus and abide in tranquility,

source: དེ་ནི་ཚུལ་བཞིན་དགེ་བ་ཆུད་མི་གསོན། །
en: To avoid letting correct behavior and virtue go to waste,

source: དབེན་དང་ཤིན་ཏུ་སྦྱངས་དང་སོ་སོར་རྟོག །
en: And to be detached, pliant, and discerning

source: འཕགས་པའི་རིགས་ལ་དབང་ནི་སྒྱུར་བ་ཡིན། །
en: Is to uphold the noble lineage.

source: ཆོས་རྣམས་ལ་ནི་ཐེ་ཚོམ་མེད་པར་གྱུར། །
en: (3) “Being without doubt regarding phenomena,

source: དེ་ལ་ཀུན་ནས་ལྡང་དང་འགྱོད་པ་མེད། །
en: Having neither regret nor agitation,

source: དེ་ལ་མ་རིག་གཏི་མུག་མུན་པ་མེད། །
en: And being without ignorance, delusion, and confusion,

source: བདེན་པ་སྣང་བ་ཡོངས་སུ་ཤེས་པ་ཤེས། །
en: One knows the deep understanding of the illumination of truth.

source: ཚུལ་ཁྲིམས་དག་པ་དམིགས་པ་མེད་པ་སྟེ། །
en: “Being without objectification purifies morality,

source: ཤེས་རབ་དམ་པ་བསམ་གཏན་ཏིང་འཛིན་དག །
en: True insight purifies concentration and absorption,

source: གཉིས་བསལ་ནས་ནི་རྣམ་པར་གྲོལ་བ་དག །
en: Eliminating dualism purifies liberation,

source: ལྷག་པའི་ང་རྒྱལ་མེད་ཅིང་ཤེས་པ་དག །
en: And being without excessive pride purifies understanding.

source: དུས་གསུམ་དག་ལ་ཡེ་ཤེས་མཐོང་མི་ཆགས། །
en: “Purifying the three times, one is not attached to the vision of wisdom.

source: འདོད་ཆགས་བྲལ་བའི་ཤེས་པས་ཆོས་ཀྱང་དག །
en: Phenomena are purified by understanding free of desire.

source: དག་ནས་འདིར་ནི་དེ་ལ་རློམ་སེམས་མེད། །
en: Having been purified, one has no arrogance about it.

source: འདི་ནི་གང་དག་ཤེས་རབ་ལྡན་པའི་རྒྱན། །
en: These are the ornaments of those possessing insight.

source: ཤེས་རབ་ཀྱིས་ནི་སྦྱིན་པ་བརྒྱན་གྱུར་ཏེ། །
en: “Insight that adorns generosity

source: རྨི་ལམ་སྒྱུ་མ་ཚོལ་བ་མེད་པའི་ཕྱིར། །བདག་དང་བྱང་ཆུབ་དེ་བཞིན་སེམས་ཅན་རྣམས། །འཁོར་གསུམ་པོ་དག་དེ་དག་རྣམ་པར་སྦྱོང་། །
en: Purifies three aspects: Agent, awakening, and sentient beings, Since they are known to be illusory, unfindable, and dreamlike.

source: ཤེས་རབ་ཀྱིས་ནི་ཚུལ་ཁྲིམས་བརྒྱན་གྱུར་ཏེ། །
en: “Insight that adorns morality

source: གཟུགས་བརྙན་སྒྱུ་མ་བྲག་ཅ་འདྲ་བའི་ཕྱིར། །ལུས་དང་ངག་རྣམས་དང་ནི་དེ་བཞིན་སེམས། །འཁོར་གསུམ་པོ་དག་དེ་ནི་རྣམ་པར་སྦྱོང་། །
en: Purifies three aspects: Body, speech, and mind, Since they are known to be like a reflection, an echo, and an illusion.

source: ཤེས་རབ་ཀྱིས་ནི་བཟོད་པ་བརྒྱན་གྱུར་ཏེ། །
en: “Insight that adorns patience

source: མཁས་དང་མཐོ་མིན་དམའ་བར་འགྱུར་མིན་དང་། །དམ་པའི་ཆོས་སྐུ་རྟག་ཏུ་རབ་རྟོག་པ། །འཁོར་གསུམ་པོ་དག་དེ་ནི་རྣམ་པར་སྦྱོང་། །
en: Purifies three aspects: The learned are neither elated nor dejected, And they maintain the steady realization of true dharmakāya.

source: ཤེས་རབ་ཀྱིས་ནི་བརྩོན་འགྲུས་བརྒྱན་གྱུར་ཏེ། །
en: “Insight that adorns vigor

source: སྐྱོ་བ་མེད་ཅིང་བསམ་པ་བརྟན་པ་དང་། །དེ་ནི་བླང་བ་མེད་ཅིང་དོར་མེད་པ། །འཁོར་གསུམ་པོ་དག་དེ་ནི་རྣམ་པར་སྦྱོང་། །
en: Purifies three aspects: Not being disheartened, keeping a stable intention, And neither accepting nor rejecting.

source: ཤེས་རབ་ཀྱིས་ནི་བསམ་གཏན་བརྒྱན་གྱུར་ཏེ། །
en: “Insight that adorns concentration

source: དེ་ལ་མ་ཆགས་གྱུར་དང་ལྷག་མཐོང་དང་། །མཁས་དང་མངོན་པར་ཤེས་པ་སྐྱེད་པ་དང་། །འཁོར་གསུམ་པོ་དག་དེ་ནི་རྣམ་པར་སྦྱོང་། །
en: Purifies three aspects: Nonattachment, special insight, And gaining mastery and superknowledge.

source: ཤེས་རབ་ཀྱིས་ནི་ཐབས་ཀྱང་བརྒྱན་བྱེད་དེ། །
en: “Insight that adorns method

source: ཤིན་ཏུ་སྡུད་དང་གཟུངས་དང་ཡང་དག་སྨོན། །འཁོར་གསུམ་པོ་དག་དེ་ནི་རྣམ་སྦྱོང་ཞིང་། །སེམས་ཅན་ཆོས་དང་དེ་བཞིན་ཞིང་རྣམས་སྦྱོང་། །
en: Purifies three aspects: The means of attraction, retention, and aspirations Related to beings, the Dharma, and the buddhafields.

source: དྲན་པ་ཉེ་བར་གཞག་ལ་དྲན་མི་འཇུག །
en: “One does not engage mindfully in the applications of mindfulness,

source: ཡང་དག་སྤོང་བ་རྣམས་ལ་གཉིས་མེད་དེ། །
en: One is free from duality regarding the correct exertions,

source: རྫུ་འཕྲུལ་གྱིས་ནི་ལུས་དང་སེམས་ཀྱང་དབེན། །
en: One is physically and mentally detached through the miraculous powers,

source: སེམས་ཅན་གྱིས་ནི་དབང་པོ་ཀུན་མི་ཤེས། །
en: And one has all the spiritual faculties that are not known to sentient beings.

source: བདུད་དང་ཉོན་མོངས་རྣམས་ཀྱིས་ཟིལ་མི་ནོན། །
en: “One is not overpowered by the māras or afflictive emotions,

source: ཆོས་ཀྱི་རང་བཞིན་ཚུལ་བཞིན་རྗེས་སུ་རྟོགས། །
en: Correctly realizes the nature of phenomena,

source: དེ་བཞིན་ལམ་ལ་འོང་མེད་འགྲོ་བ་མེད། །
en: And is without coming and going with regard to the paths—

source: དེ་ནི་ཤིན་ཏུ་ཞི་བས་ཞི་གནས་ཤེས། །
en: “One understands tranquil abiding through serenity,

source: དེ་ཡི་ལྷག་མཐོང་སྤྱོད་ཡུལ་མཐའ་ཡས་ཏེ། །
en: And the special insight based on this is boundless in scope.

source: ཆོས་ཀྱི་ཕུང་པོ་ཅི་བཞིན་ཕུང་པོ་ཤེས། །
en: One understands the aggregates just as one does the collections of Dharma

source: ཁམས་ནི་ནམ་མཁའ་མཚུངས་ཤིང་འདྲ་བར་ཤེས། །
en: And that the elements are similar to space.

source: དེས་ནི་སྟོང་པ་ལྟ་བུར་སྐྱེ་མཆེད་ཤེས། །
en: “One understands the sense fields to be like a void

source: རྟེན་པས་བསགས་པས་ཆོས་རྣམས་འབྱུང་མེད་དེ། །
en: And that phenomena are unoriginated because they come together dependently.

source: དོན་དམ་བདེན་པར་འཁྲུགས་པ་མེད་པར་ཤེས། །
en: One understands the ultimate truth without turmoil,

source: ཚུལ་བཞིན་གྱིས་ནི་ངེས་པར་རྟོགས་པར་ཤེས། །
en: And one properly understands definitive realization.

source: དུས་གསུམ་ལ་ནི་ཆགས་མེད་ཡེ་ཤེས་འཇུག །
en: “Engaging in wisdom unattached to the three times,

source: རྣམ་པར་གཞག་ཕྱིར་ཕུང་པོ་གསུམ་ཡང་ཤེས། །
en: One understands the three collections in terms of their classification

source: དཀོན་མཆོག་གསུམ་ནི་མཚན་ཉིད་གཅིག་ཏུ་ཤེས། །
en: And the single characteristic of the Three Jewels.

source: རྣམ་བསྒྲུབས་མཚན་ཉིད་སྒྱུ་མ་ལྟ་བུར་ཤེས། །
en: “One understands that the characteristics of fabrications are like an illusion,

source: ཡོངས་བརྟགས་རྩ་བ་རྨི་ལམ་ཇི་བཞིན་ནོ། །
en: That the root of false imaginings is just like a dream,

source: རྣམ་འཕྲུལ་མཚན་ཉིད་སྨིག་རྒྱུ་འདྲ་བ་སྟེ། །
en: That the characteristics of projections are like a mirage,

source: འཕོ་མེད་ཆོས་རྣམས་གཟུགས་བརྙན་མཚན་ཉིད་དོ། །
en: And that motionless phenomena have the characteristics of a reflection.

source: འདུ་འཕྲོད་བྱུང་བ་མིག་ཡོར་ལྟ་བུ་སྟེ། །
en: “Composite things are like a hallucination.

source: རྐྱེན་རྣམས་ཀྱིས་ནི་བྲག་ཅ་ཇི་བཞིན་ནོ། །
en: Dependent on conditions, they are just like an echo.

source: ཆོས་ཀྱི་དབྱིངས་ནི་རྟག་ཏུ་མ་འདྲེས་ཤེས། །
en: One understands the realm of phenomena to be always uncorrupted—

source: དེ་བཞིན་ཉིད་ནི་གནས་མེད་དེ་རབ་ཤེས། །
en: It is suchness, which is groundless.

source: ཡང་དག་མཐའ་ནི་རྟག་ཏུ་མི་གཡོ་ཆོས། །
en: “The limit of reality, the ever-motionless reality,

source: འདུས་མ་བྱས་དང་འདུས་བྱས་གཉིས་སུ་མེད། །
en: Is without the duality of the conditioned and unconditioned.

source: ཤེས་རབ་ཟབ་ཅིང་བློ་ནི་རབ་ཡངས་པར། །
en: Adorned with such deep and vast understanding,

source: བརྒྱན་ནས་སངས་རྒྱས་ཆོས་རྣམས་ཚོལ་བར་བྱེད། །
en: One seeks out the qualities of a buddha.

source: དེ་ནི་ནམ་ཡང་དྲན་པ་བརྗེད་པ་མེད། །
en: (4) “Having memory that never forgets,

source: ཆོས་རྣམས་ཀུན་ཏུ་འཛིན་ཅིང་འཛིན་པར་བྱེད། །
en: One strives to retain and fully retains the teachings.

source: དོན་དང་ཚིག་འབྲུ་ལ་ནི་རྟག་ཏུ་མཁས། །
en: Ever learned in meanings and phonemes,

source: ངེས་ཚིག་ཤེས་པ་རྟག་པར་རྟོགས་ཁོང་ཆུད། །
en: One knows etymologies and always gains comprehension.

source: ཆགས་མེད་ཚིག་དང་རྩུབ་པ་མ་ཡིན་དང་། །
en: “One speaks words that are dispassionate and refined,

source: རབ་ཏུ་གྲོལ་བའི་ཚིག་དང་བརྫུན་མེད་ཚིག །
en: Liberating and without falsehood.

source: ཐོས་པ་ཀུན་དོན་རྟག་ཏུ་རྟོག་པ་དང་། །
en: Always realizing the meaning of what has been studied,

source: མཁས་པ་དེ་ནི་ཡེ་ཤེས་རྟོན་པར་བྱེད། །
en: The learned rely on wisdom.

source: ངེས་དོན་མདོ་སྡེ་རྟོགས་པར་རབ་ཏུ་ཤེས། །
en: “Being well acquainted with and understanding sūtras of definitive meaning,

source: གང་ཟག་མེད་པའི་ཆོས་ཉིད་རྟོན་བྱེད་ཅིང་། །
en: Relying on the true nature that is devoid of any person,

source: འཇིག་རྟེན་འདས་པའི་ཆོས་ཉིད་ལ་ཡང་རྟོན། །
en: And relying also on the true nature that is supramundane,

source: དེ་ནི་གཟུངས་ཀྱིས་བརྒྱན་པར་གྱུར་པ་ཡིན། །
en: One is adorned with retention.

source: དེ་ཡི་ཚིག་ནི་བདེན་པའི་རྗེས་སུ་འཐུན། །
en: “One’s words correspond with the truth—

source: གཟུང་བར་འོས་དང་དུས་སུ་འོས་པ་ཡིན། །
en: They are suitable to keep in mind and suitable to the occasion.

source: དེ་ཡི་ཆོས་བསྟན་དེ་ནི་འབྲས་བུ་ཡོད། །
en: One’s teaching of the Dharma bears fruit,

source: ཕྱེད་པ་དང་ནི་དུས་སུ་རྒྱུན་ཆགས་འཇུག །
en: Is appropriate, and is always delivered in a timely manner.

source: དེ་ཡི་སྤོབས་པ་མགྱོགས་པ་སྐྱེ་བ་སྟེ། །
en: “One’s eloquence is swift,

source: ཤུགས་ཅན་དང་ནི་མྱུར་དང་རྟག་མི་ཆགས། །
en: Forceful, quick, and always dispassionate.

source: རྒྱུན་ཆད་མེད་དང་འཁྲུལ་མེད་ངེས་པའི་ཚིག །
en: It is uninterrupted, undistorted, and replete with etymologies.

source: ལེགས་པར་བརྒྱུས་པའི་ཕྲེང་བས་ལེགས་བརྒྱན་བཞིན། །
en: It is ornamented like a nicely threaded rosary.

source: ལྷ་དང་ཀླུ་ཡི་སྐད་ནི་རབ་ཏུ་ཤེས། །གནོད་སྦྱིན་དག་དང་དྲི་ཟ་ལྷ་མིན་དང་། །མཁའ་ལྡིང་མི་འམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེ། །སེམས་ཅན་ཀུན་གྱི་སྐད་ཀྱང་རབ་ཏུ་ཤེས། །
en: “One knows the languages of all beings: Devas and nāgas, Yakṣas, gandharvas, asuras, Garuḍas, kiṃnaras, and mahoragas.

source: འཁོར་ལྷགས་ཤེས་ནས་སྤ་གོང་མེད་པ་སྟེ། །
en: “Knowing how to join a gathering without being intimidated

source: སྨྲ་བ་མཐོང་ནས་ཞུམ་པར་གྱུར་པའང་མེད། །
en: And not being dejected when watching orators,

source: འཇིགས་པ་མེད་པར་ཆོས་ཀྱི་གཏམ་ཡང་རྗོད། །
en: One gives Dharma lectures fearlessly,

source: འདྲི་བ་རྣམས་ལ་ངེས་འབྱུང་རབ་ཏུ་ཤེས། །
en: Exercising discretion toward questioners.

source: ལྷག་པའི་ང་རྒྱལ་ཅན་མཐོང་སྣྲེལ་ཞི་ཡི། །
en: “One gives a loosely organized lecture when noticing the arrogant

source: གཏམ་བརྗོད་རྣལ་འབྱོར་མཐོང་ནས་རྗེས་སུ་འཐུན། །
en: And a well-organized lecture when noticing practitioners.

source: ང་རྒྱལ་ཅན་ལ་ལག་ན་རྡོ་རྗེ་སྟོན། །
en: One manifests as Vajrapāṇi to the proud

source: ཡུལ་མངོན་ཆགས་ལ་སྲེག་པའི་བསྐལ་པ་སྟེ། །
en: And the end of the eon to those who cling to objects.

source: ཐེག་པ་གསུམ་གྱི་རིམ་པའི་གཏམ་ཡང་རྗོད། །
en: “Giving lectures about the progression of the three vehicles,

source: དོགས་པ་ཀུན་གྱི་ཐེ་ཚོམ་གཅོད་པ་སྟེ། །
en: Eliminating the doubts of all the skeptics,

source: བློ་ཡི་ཆོས་རྣམས་མངོན་སུམ་འགྱུར་བ་ཡིན། །
en: And revealing the Dharma teachings with one’s mind,

source: དེ་ཡི་ཤེས་རབ་ནམ་ཡང་གཞན་མི་ལྟོས། །
en: One never allows one’s understanding to depend on others.

source: ཡི་གེ་ཐམས་ཅད་རྟག་ཏུ་ཟད་མི་ཤེས། །
en: “One never runs out of words,

source: དོན་རྣམས་ངེས་པ་དག་ལ་རྒྱུན་ཆགས་ཏེ། །
en: And one keeps the subject matter decisive and consistent.

source: འདི་ནི་སངས་རྒྱས་ཆོས་རྣམས་མཐའ་ཡས་བརྗོད། །
en: In describing limitless buddha qualities,

source: ཀུན་ནས་ཉོན་མོངས་སྐྱོན་ནི་མཐའ་ཡས་ཤེས། །
en: “One knows the limitless flaws of pollution

source: རྣམ་པར་བྱང་བའི་ཕན་ཡོན་ཐུག་པ་མེད། །
en: And the infinite benefits of purification.

source: དེ་བཞིན་སེམས་ཅན་དབང་པོ་ཐམས་ཅད་ཤེས། །
en: One knows all the capacities of beings

source: སངས་རྒྱས་གནང་བའི་སོ་སོ་རིག་པ་ཐོབ། །
en: And attains the discriminating knowledge granted by the Buddha.

source: དེ་ནི་གཟུངས་ཀྱིས་བརྒྱན་པར་གྱུར་པ་སྟེ། །
en: “This is to be adorned by retention.

source: དེ་ཡི་ཡོན་ཏན་འདི་དང་གཞན་དག་ཀྱང་། །
en: Even if one were to express these and other qualities

source: བསྐལ་པར་རྒྱུན་ཆད་མེད་པར་རབ་བརྗོད་ཀྱང་། །
en: For eons without interruption,

source: ཡོན་ཏན་མཐའ་ནི་རྟོགས་པར་མི་ནུས་སོ།། །།
en: One would be unable to reach their limit.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One spoke the following words to the bodhisattva Dhāraṇīśvara­rāja:

source: རིགས་ཀྱི་བུ་སྣང་བ་གང་དག་གིས་སྣང་བར་གྱུར་ན་བྱང་ཆུབ་སེམས་དཔའ་མུན་པ་མུན་ནག་དང་བྲལ་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་དག་པ་སྤྱོད་པར་འགྱུར་བ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྣང་བ་ནི་བརྒྱད་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are eight bodhisattva illuminations that brighten bodhisattvas so that they are free from the thick darkness of confusion and engage in pure bodhisattva activities.

source: འདི་ལྟ་སྟེ། དྲན་པའི་སྣང་བ་དང་། བློ་གྲོས་ཀྱི་སྣང་བ་དང་། རྟོགས་པའི་སྣང་བ་དང་། ཆོས་ཀྱི་སྣང་བ་དང་། ཤེས་པའི་སྣང་བ་དང་། བདེན་པའི་སྣང་བ་དང་། མངོན་པར་ཤེས་པའི་སྣང་བ་དང་། སྒྲུབ་པའི་སྣང་བ་སྟེ།
en: They are the illuminations of (1) mindfulness, (2) intelligence, (3) comprehension, (4) phenomena, (5) knowledge, (6) truth, (7) superknowledge, and (8) accomplishment.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྣང་བ་ནི་བརྒྱད་པོ་འདི་དག་གོ། །
en: Son of noble family, those are the eight bodhisattva illuminations.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དྲན་པའི་སྣང་བ་གང་ཞེ་ན།
en: “Son of noble family, you may ask, ‘What are the bodhisattva illuminations of mindfulness?’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དྲན་པའི་སྣང་བ་ནི་བརྒྱད་པོ་འདི་དག་སྟེ། བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྔོན་བྱས་པའི་དགེ་བའི་རྩ་བ་ཆུད་མི་གཟོན་པ་དང་། དགེ་བའི་རྩ་བ་མ་བྱས་པ་སོགས་པ་དང་། ཐོས་པའི་ཆོས་རྣམས་མི་བརྗེད་པ་དང་། དོན་རྣམ་པར་ངེས་པ་རྗེས་སུ་ཐོབ་པ་དང་། ཡུལ་དྲུག་གིས་མི་འཕྲོགས་པ་དང་། མི་དགེ་བའི་ཆོས་སྤང་ཞིང་དགེ་བའི་ཆོས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་དྲན་པ་རྒྱ་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པར་གྱུར་པ་དང་།
en: There are eight bodhisattva illuminations of mindfulness: when one prevents the roots of virtue performed in the past from going to waste, accumulates roots of virtue that have not yet been performed, does not forget teachings that one has heard, ascertains their meaning, is not carried away by the six kinds of sense objects, abandons nonvirtuous factors, and accomplishes virtuous factors, then mindfulness has become vast and excellent.

source: དེ་དྲན་པ་ཕུན་སུམ་ཚོགས་པར་རིག་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཆོས་ཀྱི་གྲོང་ཁྱེར་སྲུང་བར་འཇོག་པ་དང་།
en: Realizing that the bodhisattvas’ mindfulness has become excellent, the blessed buddhas appoint them as guardians of the city of the Dharma.
